---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundWarning
source: html/fd41e15d-e934-e769-bc40-e468247d13d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoAutoRouteSolutionFoundWarning Property

No auto-route solution was found.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; }
```